Revit 2015 API
RebarShapeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual RebarShapeSetIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As RebarShapeSetIterator
Visual C++
public:
virtual RebarShapeSetIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the set.
See Also
RebarShapeSet Class
Autodesk.Revit.DB.Structure Namespace